// while (codition){ // Это цикл

// }

// let i = 0;
// while(i<3){
//     alert(i)
//     i++
// }

// let тренировка = 2;
// тренировка++ // два плюса это всегда +1 
// console.log(тренировка)

// let тренировка1 = 10
// тренировка1-- // два минуса это всегда -1
// console.log(тренировка1)

// let тренировка2 = 2
// // тренировка2++
// // ++тренировка2 
// console.log(++тренировка2) //тестирование в режиме реального времени, вывод моментально в консоль

// while(i)
// while(i!=0) // данные записи одинаковы (while(i) == while(i!=0)

// let i =3;
// while(i){ 
//     alert(i)
//     i--
// }

// let i = 3
// while(i) alert(i--) // эта запись аналогична записи выше, просто короче

// let i =0;
// do{
//     alert(i);// тело цикла
//     i++
// }while(i<3);

// for(начало; условие; шаг){ // самый распространённый цикл, часто используемый
//     // тело цикла
// }

// for(let i = 0; i<3;i++){
//     alert (i)
// }
// Алгоритм действия цикла for
// (Если условие == true, то Выполнить тело, Выполнить шаг)
// (Если условие == true, то Выполнить тело, Выполнить шаг)
// (Если условие == true, то Выполнить тело, Выполнить шаг)
// ...........

//for (let i =0;i<3;i++)alert(i)
// Выполнить начало let i=0

// for(let i=0; i<3;i++){
//     // console.log(i);
// }

// for i=0

// for(i=0;i<3;i++){

// }
// console.log(i)


// let n=0;
// for(;;){
// console.log(n++)
// if (n>10)break
// }

// for(let i=0; i<10;i++){
// if(i % 2==0)continue // является продолжением, а-ля баном
// console.log(i)
// }


// ДОМАШНЕЕ ЗАДАНИЕ:


// let n=0;
// for(;;){
// console.log(n++)
// if (n>50)break
// }

// let n=50;
// for(;;){
// console.log(n--)
// if (n<25)break
// }

for(let i=2500; i<3000;i++){
if(i % 2==0)continue
console.log(i)
}